Tekla Open API Reference for Tekla Structures 2025
HelpViewer.DisplayHelpTopicIndependent Method
 Method for opening Tekla Structures help viewer independently from given file path with given help topic and language.
 Namespace: Tekla.Structures.Dialog
 Assembly: Tekla.Structures.Dialog (in Tekla.Structures.Dialog.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static bool DisplayHelpTopicIndependent(
	string helpViewerFilePath,
	string helpTopic,
	string language
)
Public Shared Function DisplayHelpTopicIndependent (
	helpViewerFilePath As String,
	helpTopic As String,
	language As String
) As Boolean
Parameters
helpViewerFilePath
Type: System.String
Full file path to HelpViewer.exe containing the name of the executable.
helpTopic
Type: System.String
Help topic (e.g. Help file name without extension).
language
Type: System.String
Help language. Defaults to enu.
Return Value
Type: Boolean
True if success, otherwise false.
See Also
Reference
HelpViewer Class
Tekla.Structures.Dialog Namespace